{
    "religion": [
        {
            "id":1,
            "name": "Buddhism"
        },
        {
            "id":2,
            "name": "Hinduism"
        },
        {
            "id":3,
            "name":"Islamic"
        },
        {
            "id":4,
            "name":"Christianity"
        },
        {
            "id":5,
            "name":"Catholic"
        }
    ], 
    "time":[
        {
            "id":1,
            "name":"January"
        },
        {
            "id":2,
            "name":"February"
        },
        {
            "id":3,
            "name":"March"
        },
        {
            "id":4,
            "name":"April"
        },
        {
            "id":5,
            "name":"May"
        },
        {
            "id":6,
            "name":"June"
        },
        {
            "id":7,
            "name":"July"
        },
        {
            "id":8,
            "name":"August"
        },
        {
            "id":9,
            "name":"September"
        },
        {
            "id":10,
            "name":"October"
        },
        {
            "id":11,
            "name":"November"
        },
        {
            "id":12,
            "name":"December"
        }
    ],
    "nation":[
        {
            "id":1,
            "name": "Viet Nam"
        },
        {
            "id":2,
            "name": "Brasil"
        },
        {
            "id":3,
            "name": "Chinese"
        },
        {
            "id":4,
            "name": "India"
        },
        {
            "id":5,
            "name": "Hong Kong"
        },
        {
            "id":6,
            "name": "Japan"
        },
        {
            "id":7,
            "name": "Ireland"
        },
        {
            "id":8,
            "name": "Hawaii"
        },
        {
            "id":9,
            "name": "Saudi Arabic"
        },
        {
            "id":10,
            "name": "Russia"
        },
        {
            "id":11,
            "name": "Turkey"
        },
        {
            "id":12,
            "name": "UK"
        },
        {
            "id":13,
            "name": "Europe"
        }

    ],
        "festival": [
        {
            "id":1,
            "name": "Rio Carnival Festival",
            "image":"img/Rio.jpg",
            "religion": "Catholic",
            "rel_id": 5,
            "time": "March",
            "time_id": 3,
            "nation_id": 2,
            "description": "Rio Carnival is a street festival filled with music and captivating samba dances in Brazil. Held in the city of Rio de Janeiro, the Rio Carnival is known as the most spectacular and captivating show on earth. This year's festival starts on February 28 and ends on March 4"
        },
        {
            "id":2,
            "name": "Festival of Colors",
            "image":"img/nembotmau.jpg",
            "religion": "Hinduism" ,
            "rel_id": 2,
            "time": "March",
            "time_id": 3,
            "nation_id": 4,
            "description": "Celebrated on the full moon day of the Hindu month of Phalgun, Holi also known as the Festival of Colors is one of the important festivals of India, as well as many countries with communities. Hindus live. Holi festival marks the end of winter and the beginning of spring with the hope of a bountiful harvest. This festival also celebrates the victory of good over evil. Holi is an ancient Hindi festival with many cultural and religious rituals. Preparing the Holika pyre: Days before the festival, people begin to celebrate. Collect wood and combustible materials for campfires at parks, community centers, temple areas, and other open spaces. On the pyre is an effigy representing Holika, who tricked Prahalad into the fire. In the house, the women prepare to cook typical holiday dishes such as gujiya, mathri, malpuas as well as many other delicious dishes for the festival.Holika Dahan: On the eve of the festival, usually just in time or after sunset, people gather together and light the pyre. This ritual is called Holika Dahan. The ritual symbolizes the victory of good over evil. Everyone sang and danced happily around the fire. Play with color The Holi festival officially started the next morning and everyone played with colors. Everyone holds in their hand dry gouache or balls of colored liquid to throw and spray on others. Traditionally, these colors are mixed from natural botanicals, therefore can be easily removed like saffron, sandalwood and rose. People come together to take part in this exciting game. By the end of the morning, everyone looks like a colorful painting. And this is the reason why Holi festival is also called Color Festival. People gather in groups to sing and dance while drums and dholak sound. Every time the war with colors is paused, everyone eats gujiya, mathri, malpuas and many other traditional dishes. Bhang, a beverage made from local herbs, is also an integral part of Holi. Other variations of the festival In the Braj region near Mathura, northern India, the festival can be extended. longer than a week. Here, people not only have fun with colors but also have another special day, when the men go around with their shields and the women have the right to hit their shields. with sticks. In the south of India, people worship and make offerings to Kaamadeva, the god of love in Indian mythology on the occasion of the festival. At the end of the festival: After a day of playing with colors, everyone takes a bath. Wash up and put on new outfits to welcome friends and family over. Holi is also a festival of forgiveness and the beginning of a new beginning, with the aim of creating harmony in society, leaving behind all hatred."
        },
        {
            "id":3,
            "name": "Taiwan Lantern Festival",
            "image":"img/dentroi.jpg",
            "religion": "Buddhism",
            "rel_id": 1,
            "time": "February",
            "time_id": 2,
            "nation_id": 5,
            "description": "Origin of the Lantern Festival in Taiwan: A legend has it that this festival actually dates back to the Han Dynasty (206 BC - 220), he was a devout Buddhist, so he ordered people to light a lamp on the night of January 15 to pay respects. Buddha. Accordingly, holding torches or lanterns on this night also made it easier for people to see the gods descending from heaven to bless the people. According to another legend, in the Tang Dynasty, emperors often Celebrate the festival by ordering hundreds of beautiful court ladies to sing and dance in the bright light of lanterns. This activity gradually spread to the common people and developed into the most popular festival of the year, after the Lunar New Year. The festival is also known as Tet Nguyen Tieu. In the past, this festival, along with the Lunar New Year, lasted 45 days. Today, it's only for a week. The shimmering lantern festival attracts a lot of tourists: During this festival, various events are held all over Taiwan. In 1990, the Taiwan Tourism Bureau held the first Taipei Lantern Festival. And it has become the biggest tourist event in Taiwan over the years. Thanks to the advancements of modern technology, every year, a giant lantern will be erected in the middle of the square right at the Memorial Memorial Museum. About Thach, and often carry a theme suitable for that year's zodiac. Lantern installations include decorations that combine laser lights, music and sculptures. On four sides of the Chiang Kai-shek Memorial Museum are displayed small lanterns depicting folklore. and historical events. Larger multi-colored lanterns with images of plants and animals such as butterflies, dragons, dinosaurs and birds, etc. are also hung along the roads. You can also admire the performances. Lively and interesting folk performances such as lion dance, dragon dance, acrobatics, skits, mock battles, etc. Besides, there are stalls selling traditional handicrafts such as fan paintings, lanterns, sculptures, etc. carved dough, blown candies, paper cuts, knots and many delicious snacks. During the festival, the streets of Taipei transform into tunnels of light that make the whole city sparkle. brilliant. Every year, this event attracts tens of thousands of visitors from all over Taiwan and other countries in the region, making it one of Asia's most prominent tourist attractions every New Year. .Since 2001, Kaohsiung, Taiwan's second largest city, has also started holding annual lantern festivals. The Kaohsiung Lantern Festival is held along the river of love that flows through the city. The belief of Taiwanese people in the lantern festival: There is a special type of lantern called the sky lantern in Pingxi, New Taipei City. It is made of a frame (usually bamboo but today some are made of thin steel frames) covered with paper or a thin cloth. Inside the lantern is a wick impregnated with oil. When the wick is lit inside, the entire lantern is filled with hot air and rises to the sky. It is believed that the sky lantern is an invention of Khong Minh (181-234 AD), a famous military strategist, scholar, engineer, and politician of the Three Kingdoms period. Hence it is also known as “Kong Minh Lantern”. It is believed that these lanterns were first used as a means of transmitting signals in the army between military locations. In Binh Khe, sky lanterns are used in remote mountainous areas where looting is common. People here in the past, to convey safety messages to the surrounding areas, they used to release lanterns into the sky. In addition, in the annual traditional Lantern Festivals, releasing lanterns into the sky is also considered a custom to bring many good things and good luck. Today, people even write New Year wishes on lanterns and release them into the sky. They believe that the lanterns will bring their wishes to the gods in heaven. In addition to the lantern festival, there are many other colorful, strange, and interesting festivals around Taiwan in May. Lunar January. It's a great time for travelers who want to experience Taiwan's authentic culture, hospitality, customs and traditional foods during the festive season. For those who are looking for a vacation to experience With different cultures around the world, Taiwan is definitely a place you don't want to miss! Legend has it that these ceremonies date back to the time of the Han king - a very devout king who ordered the people to light lamps to pay respects to the Buddha; as well as thanks to the shining lights that the gods can bless all the people."
        },
        {
            "id":4,
            "name": "Cherry Blossom Festival",
            "image":"img/hoaanhdao.jpg",
            "religion": "Buddhism",
            "rel_id": 1,
            "time": "March",
            "time_id": 3,
            "nation_id": 6,
            "description": "Cherry Blossom Festival - Hanami is held every year in Japan from March to early April. Cherry blossoms bloom early in the southern regions. Cherry Blossom Festival - Hanami is a combination of Hana (花) and Mi (見) Where Mi means to see, to look at; Hana means flower - cherry blossom or plum blossom. Hanami Festival - means a festival to see and enjoy cherry blossoms. This is an opportunity for everyone to enjoy the beauty, sit and chat together, and feel the spring atmosphere of Japan together. The Cherry Blossom Festival is considered a national holiday in Japan and has a long history dating back thousands of years. This is an indispensable day in Japanese culture. Japanese custom of cherry blossom viewing From the Nara period, it started from the fact that some military gods brought blooming flowers, they went to the Emperor on the occasion of spring. It was not until the early 17th century of the Edo period that cherry blossoms were popularly planted in some parks. Formed Satora Kura, the cherry blossom village. It is the place where cherry blossom festivals often take place to this day. You should come here once to see the cherry blossoms, you will be immersed in the beauty of this flower. The cherry blossom festival - Hanami, is held all over Japan. The most bustling is in big cities like Tokyo, Yokohama, Osaka, .. All Japanese are looking forward to this day. They will sing and celebrate together. Sitting together under the cherry trees, people also feel a certain serenity and joy. It can be said that on this day, people just need to look at those beautiful flowers and the bad moods and fatigue will disappear. Activities of the Japanese during the cherry blossom festival: Depending on the weather and climate of each sesame, cherry blossoms will bloom at different times. But, cherry blossom is a flower that blooms quickly and also fades quickly. Each region has different weather, flowers will bloom at different times. In January, the flowers will bloom in the south and the flowers will bloom in the north in May. From the time the flower starts to bloom until the end, it only takes about 10 days to 2 weeks. If you are a flower lover, you can travel from South to North to enjoy flowers, immerse yourself in the festive atmosphere of the whole country of Japan. You can meet girls in traditional Kimono costumes. at the cherry blossom festival. People will gather at the corners of cherry blossom trees, watching the flowers, chatting and drinking wine. Enjoy traditional dishes together. The favorite places to see flowers in Japan are Ueno Park in Tokyo, Okinawa Island, and the shores of Lake Kawaguchi in Kyoto. The current cherry blossom viewing festival is not only available in Japan but also in other countries. . Now everyone can enjoy together the pure, white, fragile beauty of cherry blossoms. This is also an opportunity for Japan to promote its cultural beauty. Under the streets filled with flower colors, in the wind are the scents of cherry blossoms in the cold weather. Immersed in the colors of the cherry blossoms, you will feel the beauty and purity that the flowers bring. Let's see the flowers together with friends and relatives."
        },
        {
            "id":5,
            "name": "Chinese Dragon Boat Festival",
            "image":"img/duathuyen.jpg",
            "religion": "Buddhism",
            "rel_id": 1,
            "time": "June",
            "time_id": 6,
            "nation_id": 3,
            "description": "The festival is held on the 5th day of the 5th lunar month to commemorate Qu Nguyen. The iconic dish of the festival is (粽子)Zongzi. The festival has been around for more than 2,000 years in China, in memory of Qu Yuan (340-278 BC), an ancient Chinese patriotic poet. This is also the day to ward off evil spirits, diseases, insects and other poisonous animals by hanging needles and wormwood, wearing perfume bags, drinking real wine and bathing in herbal water, etc. Formerly a prime minister in the Zhou Dynasty, he wrote many poems and proposed many reforms to develop the country. After the reform failed and he was exiled by the king, he chose to throw himself into the river on the 5th day of the 5th lunar month so as not to witness the country being invaded by the Qin state. After he threw himself, people rowed to save him but failed. Since then, people have commemorated Qu Nguyen on the 5th day of the 5th lunar month every year, by rowing boats to fish with Banh ú, so that they don't bite Qu Nguyen's body. Banh ú is also known as rice dumplings. sticky rice. It was thrown into the river by people to protect Qu Yuan's body from being eaten by fish. Today, cakes come in a wide variety of shapes and flavors. Wufangzhai Zongzi, Daoxiangcun Zongzi and Godly Zongzi are famous brands in China. When the festival day is approaching, the Chinese will buy ú, or make some themselves. They will also give them to relatives, friends and employees as a Dragon Boat Festival gift. Interesting things on Dragon Boat Day 1. If it rains on a festival day, it is a harbinger of a bountiful harvest, whereas a sunny day is a harbinger of a prosperous and prosperous year in all aspects of life. 2. To avoid evil spirits, the married daughter will return to her parents' house and go to Mass with her family. 3. The previous Dragon Boat Festival was actually a Health Festival. People will clean the house and take herbal baths to help prevent skin diseases. 4. Before the Qin Dynasty (221 - 207 BC), the 5th day of the 5th lunar month was considered a ghost day, and the Chinese would hang wormwood and wormwood leaves on the door frame to ward off insects. and other poisonous animals such as snakes, scorpions, centipedes, geckos and toads. 5. Carrying perfume bags can also protect them from insect bites and other skin problems. 6. Drinking real wine during the festival is an age-old custom. 7. According to superstition, the water in the well on that day is very poisonous, so people should prepare enough water in advance and avoid taking water from the well. 8. According to Chinese custom, in addition to eating banh ú, people also eat eel, boiled eggs with tea and garlic, sesame donuts and Dagao cake (made by pounding boiled glutinous rice into a paste).9. Portrait stickers (鍾馗) Paste portrait 鍾馗 is a very ugly god, whose job is to ward off evil spirits. During the festival, people stick his portrait on the door or hang it in the room to protect their home. 10. Wearing a five-color chain bracelet is also a popular tradition for children, hoping for good luck and health. The five colors include green, white, yellow, red and black."
        },
        {
            "id":6,
            "name": "Buddha's Birthday Celebration",
            "image":"img/lephatdan.jpg",
            "religion": "Buddhism",
            "rel_id": 1,
            "time": "May",
            "time_id": 5,
            "nation_id": 1,
            "description": "Buddha's Birthday in Vietnam is held in the fourth lunar month every year. For mankind, this is the day recognized by the United Nations General Assembly as a holiday of the whole world, the World Day of Peace - VESAK Feast. For Buddhists across the five continents, this holiday has a very important and sacred meaning. This is also an opportunity for monks, nuns, and Buddhists around the world to express their happiness and joy about Buddha's birth and infinite gratitude to him. Buddha's Birthday at Ba Vang Pagoda 2022 is an event in a series of events to celebrate the United Nations Day of Vesak in the country and internationally. The festival is also an opportunity for monks and nuns, Buddhists to turn their hearts to pray for the peace of the nation and the people, a peaceful world, and a peaceful sentient being. In addition, the activities in the Great Ceremony also aim to preserve and promote the cultural traditions of the nation, especially Buddhist culture for the construction and defense of the Vietnamese fatherland, and at the same time express clearly the policy of religious freedom of our State. Therefore, the Buddha's birthday at Ba Vang Pagoda 2022 is solemnly held, for a large number of people to attend, contributing to spreading good values ​​in life. The festival also contributes to promoting the growth of tourists to Quang Ninh, linking the development of spiritual tourism with eco-tourism, stimulating tourism demand in the locality and surrounding areas, promoting construction and advertising. Promote the image of Quang Ninh people, open, friendly, civilized and hospitable to domestic and international friends. The activities of the festival make a practical contribution to the implementation of guidelines and policies on tourism recovery according to the policy of Quang Ninh province in the post-Covid-19 period. Joining in the common joy of Buddhists across the five continents to celebrate the Buddha's birthday, the Buddha's birthday at Ba Vang Pagoda (PL.2566 - DL.2022) will be held on 2 days: 7th and 8th of the month. 4 years of the Tiger (ie 07, 08/5/2022) with meaningful and special programs."
        },
        {
            "id":7,
            "name": "Feast of Saint Patrick",
            "image":"img/thanhpatric.jpg",
            "religion": "Catholic",
            "rel_id": 5,
            "time": "June",
            "time_id": 7,
            "nation_id": 7,
            "description": "St. Patrick's Day is a cultural and religious holiday celebrated every year on March 17. Named after Ireland's patron saint, Saint Patrick, the day honors Irish heritage with food, parades, and food. onions, drinks, Irish legends and a sort of green Does anyone drink beer? Today, the holiday is celebrated around the world, with many modern traditions inspired by Irish expats in the United States. Who is Saint Patrick? Maewyn Succat wasn't particularly religiously raised or even Irish, for that matter, so it's surprising he's become Ireland's patron saint. Born in England around AD 390, Maewyn grew up in a well-to-do Christian family, complete with slaves and possessions. However, at the age of 16, Maewyn was kidnapped and fled to Ireland, where he became a slave and tended sheep for six or seven years; different accounts. That's when Maewyn became deeply religious. Finally, legend has it, Maewyn began to hear voices, one of which told him to flee back to England. He managed to cross a ship, but once he was reunited with his family, the voice told him to return to Ireland. Before returning, he was ordained a priest and changed his name to Patricius, or Patrick, was inspired by the Latin root “patr-” for “cha”. At the time, most of Ireland was pagan and progress was difficult by the sectarian missionary, who was often beaten and imprisoned by Irish royalty and pagan chiefs. After his death, he was mostly forgotten. But then, gradually, the myth surrounding Patrick grew until he was honored as the patron saint of Ireland. Saint Patrick's Day, the American way St. Patrick's Day began as a minor religious holiday in 1631. The church declared it a holiday; Pubs closed and observers went to church. But the first St. Patrick's Day parade was even earlier and in the US, according to the Washington Post. Ancient Spanish documents discovered show that the first recorded parade in honor of Saint Patrick was in St. Augustine, Florida, in 1601. Although it was a Spanish settlement, Saint Patrick is considered the patron saint of corn in the settlement. Since its early days, the parade tradition has spread throughout the United States and abroad, including Ireland."
        },
        {
            "id":8,
            "name": "Japan Festival of Lights",
            "image":"img/lehoianhsangnhatban.jpg",
            "religion": "Buddhism",
            "rel_id": 1,
            "time": "December",
            "time_id": 12,
            "nation_id": 6,
            "description": "The Festival of Lights is a festival held at night. During the festival, many LED lights will be decorated to light up a large area, making participants feel like they are lost in a completely different world. It is the lights combined with the outdoor space in the dark to create very shimmering scenes. This is the reason why so many young people love the festival of lights. In addition to the name festival of lights, many people also call this festival of LED lights. In many countries around the world, light festivals are also held such as France, Germany, America, Japan ... and including Vietnam. In particular in Japan, the festival of lights is held quite popularly and attracts a lot of young people to visit. Light festivals in Japan are always one of the festivals that many young people are most interested in. Where does the festival of lights take place in Japan Referring to the location of the light festival, there are many places throughout Japan that hold this festival. Of course, there are some famous places with light festivals in Japan such as Tokyo light festival, Tokyo light park, Osaka light festival, Nagoya light park, the festival. light festival in Ibaraki, light festival in Kobe, light festival in Mie, light festival in Roppongi, light festival in Fukuoka, light festival in Aichi, light festival in Chiba, ... If you are near Tokyo, you should go to Tokyo to attend the light festival because many people consider the light festival in Tokyo to be the most beautiful and spectacular. Time of Japan Light Festival The Japanese Light Festival is usually held in winter during Christmas from early November to late December. Of course, there are also light festivals that last until February (Tokyo) or held in May. 8 (Nara province). Therefore, if you want to participate in the light festival in Japan, it is not necessary to come during the Christmas season because there is also a light festival taking place in Nara in the summer. Japan Light Festival ticket price The Japanese Light Festival is held in parks, shopping malls, squares, pedestrian streets or in scenic areas. Millions of LED bulbs will be lined with trees, sculptures or art forms, making passersby feel like they have just stepped into another world. Because of this feature, most light festivals in Japan are free for visitors to visit."
        },
        {
            "id":9,
            "name": "Special Hawaiian Lantern Festival",
            "image":"img/denlonghawaii.jpg",
            "religion": "Buddhism",
            "rel_id": 1,
            "time": "May",
            "time_id": 5,
            "nation_id": 8,
            "description": "In American culture, Memorial Day is a day for people to remember and honor those who have sacrificed to serve the country. In Hawaii, with the diversity of the population, a multi-colored culture is formed, which is the convergence of many different cultures. Traditionally, on Memorial Day, Hawaiians will place flowers and meaningful items on the graves of their deceased loved ones. The festival begins with the sound of blowing Pu (a type of Hawaiian sea snail shell). ) to announce the cleaning of the area and mark the start of the festival. Oli – This is a Hawaiian hymn used to grab the attention of festivalgoers, informing people to prepare themselves for the important rituals that follow. Hula – A performance Oli's visualization through dance or natural disasters, famine and disease. Gratitude in the ceremony is also for the endemic plant and animal species here, which are near and in danger of extinction. These lanterns are floated in the hope of encouraging harmony and peace for everyone.Light of Harmony – In a spirit of friendship, leaders of the communities come together to show unity in their work. committed to creating harmony in diversity in the Hawaiian community by lighting a symbolic fire together. Blessing and Transformation – Our Lady of Shinso Ito blesses the festival area, the lanterns, Those who are remembered as well as those who participate in the festival.Offering of food and water – This ritual symbolizes the spiritual nourishment of the remembered souls..."
        },
        {
            "id":10,
            "name": "Diwali Festival of Lights",
            "image":"img/lehoianhsangdiwali.jpg",
            "religion": "Hinduism",
            "rel_id": 2,
            "time": "October",
            "time_id": 10,
            "nation_id": 4,
            "description": "Diwali (or Deepwali) is a festival of lights that originated in India. This is the largest traditional Indian festival, held for 5 days in October or November, depending on the moon. Meaning of the name Diwali Diwali (or Deepwali) in Sanskrit means a row of lights. This name is started from the job in the days, houses, shops and even jobs are lit with kerosene lamps. Festival Origins Depending on the region in India, the interpretation of the origin of this festival will be different. But in general, the origin of Diwali comes from mythical beliefs about the gods. For example, the legend of Krishna's victory over the demon lord Narakasura, has become a symbol of the victory between good and evil. Or the myth of Lakshmi, the goddess of wealth and prosperity, and the god Ganesha, symbolizing wisdom and happiness. In some places, Diwali is also held in memory of King Rama, a symbol of virtue and fidelity in Indian epics. Time and place of the festival Diwali is usually celebrated in October or November across India. Traditionally, the festival will last for 5 days, each day will have a different name and meaning. The first day is called Dhanteras, to celebrate wealth and prosperity. The second day is Choti Diwali (Little Diwali) and the main Diwali on the third day. The fourth day is Padwa to promote the value of marital love. Particularly in North India, this day is called Govardhan Puja to give thanks to the god Krishna. And the last day, Bhai Duj is dedicated to brotherhood. Meaning of Diwali festival: Diwali festival series with the original meaning to celebrate the victory of good, the rise over darkness and confusion in human knowledge. Not only that, it's also a time for everyone to feel the warm festive atmosphere together, join in the joy and pray to the gods to give them good things."
        },
        {
            "id":14,
            "name": "Diwali Festival of Lights",
            "image":"img/lehoianhsangdiwali.jpg",
            "religion": "Hinduism",
            "rel_id": 2,
            "time": "October",
            "time_id": 10,
            "nation_id": 4,
            "description": "Diwali is known as the biggest traditional festival in India. Also known by many as The Festival of Lanterns because of the bright light it brings to the festival. Diwali is like the Vietnamese Lunar New Year. It is a festival to celebrate the new year of the Hindus. It is an opportunity for people to pray for peace, and wish that the power of justice will repel darkness and poverty, bringing a prosperous life. Diwali festival will last for a period of 5 days. From the 28th night of the month Ashwin-October, until the 2nd day of the month Kartika-November in the Indian calendar. Each day of the festival has a different meaning and name. The first day is dedicated to celebrating wealth and prosperity, called Dhanteras. The second day is called Choti Diwali. And the main Diwali holiday takes place on Tuesday. The fourth day is the day to celebrate and appreciate the value of the relationship between husband and wife, called Padwa or otherwise known as Govardhan Puja - the feast of the Lord Krishna. The last day is Bhai Duj, a day dedicated to brotherly love in the family. One of the most impressive points in the Diwali festival is the house of firecrackers, people who set off firecrackers. Combined with the Diyas clay lanterns are lit, forming a festival of lights that is extremely glorious and brilliant. Thereby people aspire to the victorious meaning of justice."
        },
        {
            "id":11,
            "name": "Ganesha Festival",
            "image":"img/ganesha.jpg",
            "religion": "Hinduism",
            "rel_id": 2,
            "time": "August",
            "time_id": 8,
            "nation_id": 4,
            "description": "Ganesh Chaturthi festival is one of the very important festivals of Hindus in Mumbai - Indians celebrate the birth of the elephant-headed god Ganesha - a symbol of wisdom, happiness and success. Ganesh Chaturthi festival is one of the most important Hindu festivals in India and is celebrated in August or September with many interesting programs such as traditional dances, musical performances and recitations. poem. The festival usually lasts about 10 days. Accordingly, devotees make clay or metal statues of various shapes and sizes to worship in their homes or shops for 10 days. On the 10th day, these devotees process the idol on the street and into the river. Before the festival starts, people erected monuments in the streets and worshiped the statue of Ganesha there. On holidays, it is also advised that believers should not look at the moon because doing so is incompatible with God, if not offensive to him. Music and dancing are inseparable elements. leave the festivals of India; and both were used to the maximum on this occasion. Children attending the festival often hold and hold a statue of the god Ganesh high, in addition, they also whisper in the god's ear to ask for wishes. During the festival, the image of Ganesha is placed at the altar for ten consecutive days for the people. worship. Thousands of Hindu devotees gathered along the streets where the statue of the god passed. They pray for good things with faith, Ganesha will make their dreams come true. On the 11th day, the statue is placed on a car and taken to the streets, then it is dipped into a river, lake, or sea. Previously, the statue of Ganesha was usually made of clay that could dissolve quickly in water. However, in recent years, people use plastic and plaster, so the water environment is heavily affected by toxic substances and paint. All kinds of marine life are in danger of being destroyed, so the city government has created many artificial lakes to minimize these bad impacts."
        },
        {
            "id":15,
            "name": "Ganesha Festival",
            "image":"img/ganesha.jpg",
            "religion": "Hinduism",
            "rel_id": 2,
            "time": "August",
            "time_id": 8,
            "nation_id": 4,
            "description": "Ganesh Chaturthi festival is one of the very important festivals of Hindus in Mumbai - Indians celebrate the birth of the elephant-headed god Ganesha - a symbol of wisdom, happiness and success. Ganesh Chaturthi festival is one of the most important Hindu festivals in India and is celebrated in August or September with many interesting programs such as traditional dances, musical performances and recitations. poem. The festival usually lasts about 10 days. Accordingly, devotees make clay or metal statues of various shapes and sizes to worship in their homes or shops for 10 days. On the 10th day, these devotees process the idol on the street and into the river. Before the festival starts, people erected monuments in the streets and worshiped the statue of Ganesha there. On holidays, it is also advised that believers should not look at the moon because doing so is incompatible with God, if not offensive to him. Music and dancing are inseparable elements. leave the festivals of India; and both were used to the maximum on this occasion. Children attending the festival often hold and hold a statue of the god Ganesh high, in addition, they also whisper in the god's ear to ask for wishes. During the festival, the image of Ganesha is placed at the altar for ten consecutive days for the people. worship. Thousands of Hindu devotees gathered along the streets where the statue of the god passed. They pray for good things with faith, Ganesha will make their dreams come true. On the 11th day, the statue is placed on a car and taken to the streets, then it is dipped into a river, lake, or sea. Previously, the statue of Ganesha was usually made of clay that could dissolve quickly in water. However, in recent years, people use plastic and plaster, so the water environment is heavily affected by toxic substances and paint. All kinds of marine life are in danger of being destroyed, so the city government has created many artificial lakes to minimize these bad impacts.."
        },
        {
            "id":12,
            "name": "St.petersburg White Nights Festival in Russia",
            "image":"img/lehoidemtrangonga.jpg",
            "religion": "Catholic",
            "rel_id": 5,
            "time": "June",
            "time_id": 6,
            "nation_id": 10,
            "description": "White silence is a special natural phenomenon in the city of St. Petersburg, Russia. Every year, from the end of May to the beginning of July, Russians and tourists from all over the world flock to St Petersburg to admire the splendor of the glowing night sky and visit Join many exciting activities of this one-of-a-kind festival: White Night in Russia. The highlight of the festival is the Crimson Sail event, which attracts more than a million people each year. After the colorful fireworks display on the Neva River will be the impressive appearance of a great boat with crimson sails, based on the famous story Crimson Sails by Alexander Grin."
        },
        {
            "id":13,
            "name": "Festival to end the fasting season of Ramadan",
            "image":"img/ramada.jpg",
            "religion": "Islamic",
            "rel_id": 3,
            "time": "September",
            "time_id": 9,
            "nation_id": 9,
            "description": "According to the Islamic calendar, the month of Ramadan is the 9th month of every year. This month marks the beginning of the Koran. During the 30 days of this month, Muslims do not eat, drink or do impure activities from sunrise to sunset. After the completion of the holy month of Ramadan, Muslims around the world will hold a ceremony known as Eid al Fitr or the great day of Ramadan. Eid al Fitr lasts 3 days, this is also the most jubilant time of the year for Muslims. The Muslim community is found all over the world, the Middle East to South Asia, even in parts of the world. Southeast Asian and European countries. In all of these places, the Muslim community performs rituals during the fasting month of Ramadan as well as celebrates the jubilant festival of Eid al Fitr. In each region, the festival rituals have different cultural characteristics but still follow certain general rules. On the first morning of Eid al Fitr, Muslim families get up early in the morning. Women in the family quickly prepare breakfast. Because during the previous 30 days, Muslims abstain from eating and drinking from dawn to dusk, so the first breakfast after the month of Ramadan has even more significance in terms of both religion and family values. At the end of breakfast, everyone gathers at the local mosque to pray. Eid al Fitr festival is an opportunity for people to express their gratitude and respect to each other, especially to let go of what was not in the previous year to live together and unite in the following year. Like Tet for Vietnamese people, Muslims consider Eid al Fitr to be the most special festival of the year. People take time to visit the homes of older people, wherever Muslims go, they greet each other warmly and invite each other to enjoy traditional confectionery. Besides, on the occasion of Eid al Fitr festival, Muslims also do a lot of charity. They help those in need by donating money, clothes or food. Muslims believe that people need to help each other to have the most joyful and warm festival."
        },
        {
            "id":21,
            "name": "Festival to end the fasting season of Ramadan",
            "image":"img/ramada.jpg",
            "religion": "Islamic",
            "rel_id": 3,
            "time": "January",
            "time_id": 1,
            "nation_id": 9,
            "description": "According to the Islamic calendar, the month of Ramadan is the 9th month of every year. This month marks the beginning of the Koran. During the 30 days of this month, Muslims do not eat, drink or do impure activities from sunrise to sunset. After the completion of the holy month of Ramadan, Muslims around the world will hold a ceremony known as Eid al Fitr or the great day of Ramadan. Eid al Fitr lasts 3 days, this is also the most jubilant time of the year for Muslims. The Muslim community is found all over the world, the Middle East to South Asia, even in parts of the world. Southeast Asian and European countries. In all of these places, the Muslim community performs rituals during the fasting month of Ramadan as well as celebrates the jubilant festival of Eid al Fitr. In each region, the festival rituals have different cultural characteristics but still follow certain general rules. On the first morning of Eid al Fitr, Muslim families get up early in the morning. Women in the family quickly prepare breakfast. Because during the previous 30 days, Muslims abstain from eating and drinking from dawn to dusk, so the first breakfast after the month of Ramadan has even more significance in terms of both religion and family values. At the end of breakfast, everyone gathers at the local mosque to pray. Eid al Fitr festival is an opportunity for people to express their gratitude and respect to each other, especially to let go of what was not in the previous year to live together and unite in the following year. Like Tet for Vietnamese people, Muslims consider Eid al Fitr to be the most special festival of the year. People take time to visit the homes of older people, wherever Muslims go, they greet each other warmly and invite each other to enjoy traditional confectionery. Besides, on the occasion of Eid al Fitr festival, Muslims also do a lot of charity. They help those in need by donating money, clothes or food. Muslims believe that people need to help each other to have the most joyful and warm festival."
        },
        {
            "id":16,
            "name": "Hajj",
            "image":"img/hajj.jpg",
            "religion": "Islamic",
            "rel_id": 3,
            "time": "December",
            "time_id": 12,
            "nation_id": 9,
            "description": "From hidden in the valley of Makkh province, Western Saudi Arabia, 8km east of Mecca, the city of Mina is covered with thousands of white huts to the amazement of tourists. Any signal must make the pilgrimage to Mecca at least once in a lifetime. For them this can boast, loyalty to Allah, not only the actions of the person who is determined but also the soul. Every year, nearly 3 million people from all over the world come to the holy land to participate in the festival. If you have the opportunity to visit this site during Haji, visitors will witness many interesting rituals such as: each person goes counter-clockwise seven times around a box-shaped tower called Kaaba (prayer for signal spirits) Islamic). After that, all went to Mount Arafat, also known as the Prophet's mountain - which plays a very important role in the Hajj. All people like the night and request. According to legend, the Prophet Muhammad preached from this 70m high mountain. The ritual of stoning away evil spirits is performed at the three pillars that do not stop immediately Mina at dawn and dusk. Due to the high number of casualties and alarming levels of danger, the authorities upgraded and built the multi-storey Jamarat proposal for pilgrims to throw stones here. If before, the fragrance operator had to bring his own canvas and Mina to set up, now, the pure white background is ready to welcome more than 3 million Muslims during the Hajj season. There are more than 100,000 leaves (with a length and height of 8m) made of fireproof glass, fully equipped with an air-conditioning system. The above innovation is a good thing for Muslims in reducing Minimize heavy lifting. This comes from a large fire that killed 350 people in 1997, after which the government was forced to use the same fireproof tent fabric to ensure safety. Interspersed with the tents are narrow paths leading to the ceremony area. Inside the tent there is a kitchen, bathroom and many other amenities with a capacity of up to 50 people. Pilgrims are all given color codes corresponding to each country, to avoid getting lost. The cost per participant is 500 USD. During the past two years, the city of Mina has changed significantly due to the investment in developing an infrastructure upgrade project. Typically, the construction of a fire prevention system including a heat-sensing sprinkler with an alarm connection. Attention from the government partly reduces the difficulty for pilgrims on each Hajj occasion. However, long-time residents here regret the crowded old Mina city, bustling markets and cafes. Hundreds of years ago, pilgrims only set up tents in the suburbs or residential areas of Mina. About a decade ago, this area was completely demolished, making way for large works such as pedestrian bridges, railway stations, and medical stations. Especially the thousands of huts that cater to the huge number of Muslims from all over the world."
        },
        {
            "id":17,
            "name": "Olive Oil Wrestling Festival in Turkey",
            "image":"img/dauvat.jpg",
            "religion": "Islamic",
            "rel_id": 3,
            "time": "July",
            "time_id": 7,
            "nation_id": 11,
            "description": "The Kirkpinar Olive Oil Wrestling Festival is held annually in early July in the Sarayici district in the town of Edirne, Turkey. This is considered the biggest event of the year in Turkey and is also one of the oldest wrestling sports in the world. This unique wrestling sport has been held since 1361 to commemorate the strength and The brave warriors joined the Ottoman king to conquer the land of Thrace. These olive oil wrestling matches usually last longer than regular wrestling. The most special thing is that participants have to water themselves with liters of olive oil to make their bodies more slippery, making it difficult for opponents to catch them. They also have to wear leather pants made from the skin of water buffalo and weigh up to 12 kg. Each match, the fighter must make the opponent fall to the ground or lift up from the ground, or the opponent is exhausted and asks to lose, the match will end. Currently, it has been stipulated that each match should not last more than 40 minutes, if there is no winner, there will be 15 minutes of extra play. The winner will keep the gold belt for one year, if he wins for three consecutive years, the fighter will keep the championship belt forever. But this happens very rarely. So far only one gladiator has done this, but that was 16 years ago."
        },
        {
            "id":18,
            "name": "Notting Hill Carnival",
            "image":"img/nottonghill.jpg",
            "religion": "Christianity",
            "rel_id": 4,
            "time": "August",
            "time_id": 8,
            "nation_id": 12,
            "description": "The Notting Hill Carnival has continued on Bank Holiday Monday, August 29, and players continue to pour into the streets for the second consecutive day of the festival. This is the first time the festival has taken place in 3 years, since 2019. The biggest party will take place today, August 29, the adult parade will start at noon. More than 80 bands of dancers participated in this year's festival. There will be 2 large stages, and the sound system will play music throughout the day. The parade will end at 8:30pm, while live music will run from 12pm to 7pm. Millions of people attended the two-day Notting Hill Carnival. The festival has been canceled in 2020 and 2021 due to the Covid-19 epidemic. The festival aims to celebrate Caribbean culture and its influence on London's cultural heritage. The children's parade took place on August 28, known as the traditional family day. Dancers in bright and colorful costumes dance to the music. Those present said the performance had stirred the spirits of the people. The atmosphere was like electricity, said Jules Stephenson, a member of the Emancipated Run Crew. Everyone is excited to welcome the festival back. Shauna Walsh, 38, who lives on Kensal Rise, said: The atmosphere is cozy and upbeat and joyful. Everyone is looking forward to this exciting return. Many of the roads in Notting Hill have been turned into pedestrianized streets and are open to traffic, with the exception of emergency vehicles. Most roads are closed from 6 a.m. on Sunday to 6 a.m. on Tuesday. Kensington and Chelsea Council advises people who want to travel by private car should leave the area before 6am on Sunday. Since Sunday morning, many players have sprayed paint and sprinkled glitter on their bodies, this is a form of opening festival called J'Ouvert. Stores are required not to sell glass bottles. People living here must show ID if they want to go home. Some homeowners have given up their homes for friends to come and enjoy the festival, while they have fled to other places like Wales...to take refuge. The festival usually welcomes 2.5 million visitors, many of whom are drunk and vomit on the sidewalk, so it is understandable that people here want to hide for 2-3 days."
        },
        {
            "id":23,
            "name": "Notting Hill Carnival",
            "image":"img/nottonghill.jpg",
            "religion": "Christianity",
            "rel_id": 4,
            "time": "November",
            "time_id": 11,
            "nation_id": 12,
            "description": "The Notting Hill Carnival has continued on Bank Holiday Monday, August 29, and players continue to pour into the streets for the second consecutive day of the festival. This is the first time the festival has taken place in 3 years, since 2019. The biggest party will take place today, August 29, the adult parade will start at noon. More than 80 bands of dancers participated in this year's festival. There will be 2 large stages, and the sound system will play music throughout the day. The parade will end at 8:30pm, while live music will run from 12pm to 7pm. Millions of people attended the two-day Notting Hill Carnival. The festival has been canceled in 2020 and 2021 due to the Covid-19 epidemic. The festival aims to celebrate Caribbean culture and its influence on London's cultural heritage. The children's parade took place on August 28, known as the traditional family day. Dancers in bright and colorful costumes dance to the music. Those present said the performance had stirred the spirits of the people.The atmosphere was like electricity, said Jules Stephenson, a member of the Emancipated Run Crew. Everyone is excited to welcome the festival back. Shauna Walsh, 38, who lives on Kensal Rise, said: “The atmosphere is cozy and upbeat and joyful. Everyone is looking forward to this exciting return.” Many of the roads in Notting Hill have been turned into pedestrianized streets and are open to traffic, with the exception of emergency vehicles. Most roads are closed from 6 a.m. on Sunday to 6 a.m. on Tuesday. Kensington and Chelsea Council advises people who want to travel by private car should leave the area before 6am on Sunday. Since Sunday morning, many players have sprayed paint and sprinkled glitter on their bodies, this is a form of opening festival called J'Ouvert. Stores are required not to sell glass bottles. People living here must show ID if they want to go home. Some homeowners have given up their homes for friends to come and enjoy the festival, while they have fled to other places like Wales...to take refuge. The festival usually welcomes 2.5 million visitors, many of whom are drunk and vomit on the sidewalk, so it is understandable that people here want to hide for 2-3 days."
        },
        {
            "id":19,
            "name": "Easter",
            "image":"img/lephucsinh.jpg",
            "religion": "Christianity",
            "rel_id": 4,
            "time": "April",
            "time_id": 4,
            "nation_id": 13,
            "description": "This is one of the most important holidays of the year for Christians including: Catholics, Protestants, Anglicans, Orthodox. Easter Day is celebrated every year around March or April of the solar calendar. This day commemorates the death and resurrection of Jesus Christ after being crucified. Jews call this holiday Paschafest, Egyptians call it Osterlamm/paschal lamb, and Germans call it Paschafest. called Ostara. Easter Day is also derived from the word East, referring to the East, where spring is coming. So many places call it the spring festival. What date is Easter in 2022? Because Easter takes place on any Sunday in late March or early April, there is no fixed time for this holiday. However, we can rely on the following factors to calculate the date of Easter: Easter is obligatory on Sunday. Easter Day is celebrated after the full moon day (full moon day). Easter Day must follow the Spring equinox. Therefore, Easter 2022 falls on the third Sunday of 2022, which is April 17, 2022. What is the origin and meaning of Easter? Origins of Easter After Adam and Eve sinned and were cast out of the Garden of Eden, their descendants multiplied and flourished all over the face of the earth, forming the person we are today. God sent Jesus into the world to save the world. While Jesus and his disciples entered Jerusalem on the occasion of the Passover, he was betrayed by a disciple, Judas Iscariot, in exchange for a reward from the Roman Empire. Under pressure from the Jewish religious leaders, Governor Pontius Pilate (Pilate) ordered the crucifixion on Friday for inciting rebellion. However, three days later, the tomb of the Lord was found empty. Therefore Christians believe that Jesus rose again on Sunday, three days after his death on the cross. In the Gospels and the Acts of the Apostles, it is also recorded that Jesus met his disciples in many places after his resurrection and then flew back to heaven (Ascension). Fifty days after the Resurrection is also the birth of the Church. Meaning of Easter For Christians, it is the resurrection of Jesus after his death on the cross that has made him a powerful man who can give them eternal life and save humanity. And Easter Day is a symbol of resurrection, full of life. In addition, Easter also coincides with the spring. This is the most beautiful time of the year. The season of fertility, so that there is more and more faith in good things. What do Easter days usually do? Fasting, abstaining from salty foods: For Catholics, for two days before Easter, they must abstain from meat and unnecessary needs. Leftover food will be donated to the needy or the church. Visiting the Stations of the Cross: Reflecting on the 14 Ways of the Cross from the time the Lord was arrested to his death. Leaves Ceremony: Use branches of yew trees, willows or coconut leaves to form shapes and then hang them in the house. Wait for the leaves to dry, then bring them to the priest and burn them to ashes for use on the forehead on Ash Wednesday next year. Washing feet: Starting from the story that before being arrested, Jesus washed the feet of each of his disciples as well as commanded that everyone should wash each other's feet. Regardless of position or class. Reenactment of the Crucifixion: In many places with large Catholic populations, it is often held to reenact the scene of Jesus from the time of his arrest to his death."
        },
        {
            "id":20,
            "name": "Christmas",
            "image":"img/giangsinh.jpg",
            "religion": "Christianity",
            "rel_id": 4,
            "time": "December",
            "time_id": 12,
            "nation_id": 13,
            "description": "1. ORIGINAL: In the city of Rome - Italy there has been a ceremony held on December 25 from a century before the Christian era. The Romans worshiped Mirthra, of Persian descent, brought into Rome by Roman legions. Mirthra is the Persian god of light. Feast on December 25 is the solstice of winter, the birth of Mirthra symbolizes the invincibility of the sun (Dies natalis solis invicti). During the ceremony, people worship the god with a small bison. In 274, the Roman emperor Aurélien declared the worship of the god Mirthra the state religion and made December 25 the day of celebration. Christmas did not appear in the early days of Christianity. Only from the 2nd century after many searches to be able to take a day of the year as the date of the birth of Jesus because there is no trace of this mentioned in the Gospels. Several days and months have been suggested such as January 6, March 25, April 10…but still not leading to a definitive decision. In Rome, the Church of God chose December 25 as the date of birth of Jesus Christ, certainly not without backstabbing for the traditional ceremony here: the celebration of the birth of the pagan god Mirthra. In the years 330 or 354, the Roman emperor Constantin decided to make Christmas Day December 25. In 354, Pope Libère fixed the celebration of the feast on December 25. This date had a symbolic value because, according to Malachie 3/19 and Luc 1/78, the presence of Christ was seen as a divine presence. the opening of the sun of justice. Thus, Christmas is also the birthday of Jesus, the sun of justice. The ceremony on December 25 gradually developed in the East and in Gaul (old France): in 379 in Constantinople, in the beginning of the 5th century in Gaul, in the 5th century in Jerusalem and at the end of the century. Vth in Egypt. The Eastern churches in the 4th century also celebrated in various forms on January 6 in honor of God. 2. HISTORY of Christmas Day to the End of the Middle Ages The Roman Emperor Théodore in 425 codified the rituals for Noël . The Mass on December 25 has become special for Christians. Clovis was baptized on Christmas Eve 496. In 506, the Agle bishops' conference fixed the date as an obligation. In 529, the Roman emperor Justinian decreed a paid holiday. The midnight church service has been celebrated since the 5th century during the reign of Pope Grégoire Le Grand. In the 7th century, a custom was established in Rome to celebrate three services: solemnities on the afternoon of December 24, mass in the morning and December 25 in churches. Christmas holidays spread throughout Europe: 5th century in Ireland, 7th century in Great Britain, 8th in Germany, IXth in the Nordic countries, IXth and Xth centuries in the countries of the Slavic region. wok. Since the twelfth century, religious rites have been accompanied by ceremonial tragedies, staged secrets of adoration by shepherds or processions of mage. . These “cult tragedies” were performed first in the church and then carried out in the courtyard in front of the church. 3. HOLIDAYS FROM THE renaissance Weeds have appeared in churches in Italy since the 15th century and Christmas trees in Germany in the 16th century. It was then spread to the houses of Naples and then the southern regions of France from the seventeenth century. During the renaissance in 1560, Protestants opposed the presence of the manger and preferred the custom of the Christmas tree. Along with antagonism during the seventeenth-century renaissance, tragedy tragedies performances were banned simply for being unduly profane. Today, Christmas has become a celebration for children and families. 4. MEANING OF HOLIDAY In addition to the Christian meaning, Noel is a family holiday, a privileged day to gather people, all generations in the family. This ceremony is expressed in all its forms, creating shared memories and maintaining affection between everyone in the family. Each person finds, in their own way, to build a connection: sharing a common meal, a sleepless night, hearing a story narrated, gathering around the Christmas tree… With the growing status of children in the family, Christmas Day became a celebration of children: a magical night in which almost every child's wish was fulfilled in the joys of the adults. . Christmas Day is also a message of peace: Glory to God in the highest, Peace on earth to those whom God loves. This is the verse sung by the Angels announcing the arrival of the Savior and Christmas is also the day people share with those who are abandoned, lonely, sick, old and weak..."
        },
        {
            "id":22,
            "name": "Halloween ",
            "image":"img/haloween.jpg",
            "religion": "Christianity",
            "rel_id": 4,
            "time": "October",
            "time_id": 10,
            "nation_id": 13,
            "description": "1. Halloween originated from the ancient Celtic festival of fire god Samhain According to many scholars, the present day Halloween is inherited from the ancient Celtic fire god Samhain from 6000 years ago. This festival, also known as All Hallowtide, is held after the completion of the season and marks the beginning of winter. For the ancient Celts, the time of late summer and early winter was very important to their lives. At this time, the grasslands were no longer capable of raising livestock, and the people were no longer busy with field work. They gather in groups into common houses to tell each other stories and make plans to prepare for the new year. Also at this time, when the harvest has been completed, the fields will become fallow. The Celts believed that this would be the time when the fairies would come and blow miracles on the fields. At the same time, they believe that the time of the change of seasons also coincides with the time when the gate between the two worlds is opened, the souls will return to the field and that is not a suitable place for people to visit. At this time, they will hold Samhain festival for about 3 days to honor the god of fire, give thanks after a harvest and hope the winter will pass. The Celts believe that on October 31, the laws of time and space will stop, and souls will return to earth to find the body to revive. Therefore on this day, people often put out fires in their homes, making them cold and hoping the spirits will pass. At the same time, they also have the custom of wearing costumes imitating ghosts, marching loudly around the neighborhoods to calm the fear of spirits. 2. How is October 31st chosen? In 835 AD, the Roman Catholic Church officially changed the Feast of the Assumption of the Blessed Virgin Mary on November 1 to All Saints Day instead of May 13. This is one of the major holidays of the year for Catholics and a celebratory party will be held. Since then, November 1 has been called All Saints Day and October 31 has been called All Hallow Even. Then the name became “All Hallow’s Eve”, then “Hallowe’en” and finally “Halloween”. Following the Feast of All Saints, All Souls Day will be the Feast of All Souls to unite in prayer for those who are in a state of purification in Purgatory (according to the Catholic concept). 3. The game Trick Or Treat is an ancient form of begging The game Trick Or Treat (Trick or Loc) is a traditional game on Halloween. At that time, children in costumes, holding lanterns, singing and going from house to house knock on the door and say trick or treat. Often the family will give the children candy, chocolate or prepared fruit. This game originated in ancient times and was made by beggars. On holidays of the year, they used to sing carols to wealthy homeowners to receive alms. Then on Halloween, they often disguise themselves or wear costumes made of straw and go around the villages begging for food or sweets. Gradually becoming a custom, residents often waited at home on Halloween night to wait for the costumed characters to knock on their door. Once completed, all residents including the costumed people will march together in the streets and gather in the square to celebrate together. Another ancient form of begging is during festivals such as Easter, Feast of All Saints, etc., beggars will knock on door to door, ask for food and pray for the deceased in the family. That family...."
        }
        

    ]
}
